# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!
  
#### Import all the necessary libraries here:

In [2]:
# Libraries
import pandas as pd
import numpy as np

# Challenge 1

#### Read the `employees` dataset from Ironhack's database:
* db: `employees`
* table: `employees`

Save your data in a variable called `employees`.

In [5]:
# your code here
employees = pd.read_csv("employees.csv").drop("Unnamed: 0", axis=1)
employees.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the mean `Salary` by `Department`?
**Tip**: There are 2 ways to do it: with or without pivot tables. Do it both ways.

In [8]:
# Method 1
# your code here
employees.groupby(["Department"]).agg("mean").drop("Years", axis=1)

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

In [10]:
# Method 2
# your code here
employees.pivot_table(index=["Department"]).drop("Years", axis=1)

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### Now, group the data by more than one column. Use Pandas pivot table function to select the mean `Salary` by `Department` and `Title`.

In [14]:
# your code here
employees.pivot_table(index=["Department", "Title"])["Salary"]

Department  Title
HR          VP           70.0
            analyst      32.5
IT          VP           70.0
            analyst      32.5
            associate    60.0
Sales       associate    55.0
Name: Salary, dtype: float64

#### Display the number of `Years` of work experience and the `Salary` for each `Title`. Add `Years` as a column in your pivot table.
**Hint**: Use Pandas documentation to explore the [pivot table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) function.

In [13]:
# your code here
employees.pivot_table(index=["Title"])

              Salary  Years
Title
VP         70.000000   8.00
analyst    32.500000   2.25
associate  56.666667   4.00

#### Find the mean `Salary` and number of employees in each `Department` and for each job `Title`.

In [16]:
# your code here -  index title + divide per title type?
employees.pivot_table(index=["Title"], columns=["Title"])

          Salary                    Years
Title         VP analyst  associate    VP analyst associate
Title
VP          70.0     NaN        NaN   8.0     NaN       NaN
analyst      NaN    32.5        NaN   NaN    2.25       NaN
associate    NaN     NaN  56.666667   NaN     NaN       4.0

#### For each `Department` and each job `Title`, find the `Salary` median, minimum, maximum and standard deviation. Comment your results.

In [30]:
# your code here 
# index departemetn and title + agg(median,min, max, stedev)
pivot_table1 = employees.pivot_table(values=["Salary"], index=["Department", "Title"], aggfunc=[np.median, np.min, np.max, np.std])
pivot_table1

                     median   amin   amax       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60       NaN
Sales      associate   55.0     55     55  0.000000

In [31]:
"""
salaries in HR and IT are the same over all positions.
an it associate earns more than a sales assosiate. 
there is close to no variation in salaries across the field, the max change btw max and min is only of 5
we cannot say is people in HR earn more than those in Sales as we do not have equal positions to compare. 
the NaNs are not to be removed, they represent a stdev of 0 ans should therefore be filled, they just inofmr us there there is ot stdev
"""

'\nsalaries in HR and IT are the same over all positions.\nan it associate earns more than a sales assosiate. \nthere is close to no variation in salaries across the field, the max change btw max and min is only of 5\nwe cannot say is people in HR earn more than those in Sales as we do not have equal positions to compare. \nthe NaNs are not to be removed, they represent a stdev of 0 ans should therefore be filled, they just inofmr us there there is ot stdev\n'

#### Based on your comments, fill the missing values with an appropriate value.

In [29]:
# your code here
pivot_table1 = pivot_table1.fillna(0)
pivot_table1

                     median   amin   amax       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70  0.000000
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70  0.000000
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60  0.000000
Sales      associate   55.0     55     55  0.000000

#### The stake holders want to know, for each `Department`, the number of employees and how much money is spent on salaries. Could you provide that information?

In [ ]:
# your code here

#### For each `Department` and `Title`, find the the total years of work experience and the mean `Salary`.

In [ ]:
# your code here

## Bonus Challenge 1

#### Compute the mean `Salary` after removing the maximum `Salary` for each `Department`. Create the appropriate pivot table.
**Hint**: Write a custom function.

In [ ]:
# your code here

# Challenge 2

#### Read the `fitbit` dataset from Ironhack's database:
* db: `fitbit`
* table: `fitbit`

Save your data in a variable called `fitbit`.

In [ ]:
# your code here

#### Explore you dataset in terms of data types and descriptive statistics.
**Hint**: Use Pandas functions from previous lectures.

In [ ]:
# your code here

#### You suspect that there must be a linear relationship between the `Minutes Very Active` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Very active` vs `Steps`. We'll work with matplotlib next week. As a first introduction, uncomment and complete the following code. You need to replace the # symbol for the correct function arguments.

In [ ]:
import matplotlib.pyplot as plt;

In [ ]:
"""
plt.scatter(#, #)
plt.title(#)
plt.xlabel(#)
plt.ylabel(#)
plt.show()
"""

#### What can you say about `Minutes Very Active` and `Steps`? Write a comment below.

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `Minutes Sedentary` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Sedentary` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `MinutesOfSleep` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `MinutesOfSleep` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`.

In [ ]:
columns = ['Calorie burned', 'Steps', 'Floors', 'Minutes Sedentary', 'Minutes Very Active', 'MinutesOfSleep']

In [ ]:
# your code here

#### Based on the result of the correlation matrix, which of the features are highly correlated with variable `Steps`?
**Hint**: sort the correlations of `Steps` vs the rest of the features in descending order. You can use Pandas `sort_values`.

In [ ]:
# your code here

# Challenge 3

#### Read the `time_grades` dataset from Ironhack's database:
* db: `time_grades`
* table: `time_grades`

Save your data in a variable called `time_grades`.

In [ ]:
# your code here

#### Show visually the frequency distribution of the `time_grades` dataset.

In [ ]:
# your code here

#### Is there a correlation between `Study time` and `Grade`? Use both Pearson and Spearman correlations and comment your results.

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Use matplotlib to visually plot `Study time` vs `Grade`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Could you explain the difference between Pearson and Spearman correlations?

In [ ]:
"""
your commments here
"""